
a = input('Введите строку больше 15 символов: ')
b = len(a)
while b < 15:
    a = input('Введите строку больше 15 символов: ')
    b = len(a)
if b > 15:
    print("третій символ рядка - " + a[2])
    print("передостанній символ цього рядка - " + a[-2])
    print("перші п'ять символів - " + a[:5])
    print("весь рядок, крім двох останніх символів - " + a[:-2])
    print("усі символи з парними індексами - " + a[::2])
    print("усі символи з непарними індексами - " + a[1::2])
    print("усі символи у зворотному порядку - " + a[::-1])
    print("усі символи рядка через один у зворотному порядку - " + a[::-2])
    print("довжина рядка - " + str(len(a)) + " символа")

